IDEA StatiCa Open Model
CutBeamByBeamData.WeldType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of the weld
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public WeldType WeldType { get; set; }
Public Property WeldType As WeldType
	Get
	Set
public:
property WeldType WeldType {
	WeldType get ();
	void set (WeldType value);
}
Property Value
Type: WeldType
See Also
Reference
CutBeamByBeamData Class
IdeaRS.OpenModel.Connection Namespace